#### 📖 Terraform Plan ('infra/resources/dev') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_monitor_diagnostic_setting.logs["cosmos-account"] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "logs" {
        id                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/dx-d-itn-playground-pg-cosno-01|cosmos-account-diagnostic-settings"
        name                           = "cosmos-account-diagnostic-settings"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "Requests" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "SLI" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }

        # (3 unchanged blocks hidden)
    }

  # module.app_service.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          + "API_BASE_PATH"                                   = "todo"
          + "API_BASE_URL"                                    = "https://dx-d-itn-playground-pg-apim-01.azure-api.net"
            # (3 unchanged elements hidden)
        }
        id                                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-fe-app-01"
        name                                           = "dx-d-itn-playground-fe-app-01"
        tags                                           = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS700 - ENGINEERING"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.to_do_api.azurerm_api_management_api_policy.policy will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "policy" {
        id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-backend-service backend-id="to-do-api-azure-function" />
          - 		<!-- Append base-path, if defined, before invoking the backend -->
          - 		<choose>
          - 			<when condition="@(System.String.IsNullOrEmpty("api"))"></when>
          - 			<otherwise>
          - 				<rewrite-uri template="@(System.String.Concat("api/", context.Request.Url.Path))" />
          - 			</otherwise>
          - 		</choose>
          - 		<set-header name="x-functions-key" exists-action="override">
          - 			<value>{{to-do-api-function-key}}</value>
          - 		</set-header>
          - 		<cors>
          - 			<allowed-origins>
          - 				<origin>*</origin>
          - 			</allowed-origins>
          - 			<allowed-methods>
          - 				<method>*</method>
          - 			</allowed-methods>
          - 			<allowed-headers>
          - 				<header>*</header>
          - 			</allowed-headers>
          - 			<expose-headers>
          - 				<header>*</header>
          - 			</expose-headers>
          - 		</cors>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          + <policies>
          +   <inbound>
          +     <base />
          +     <set-backend-service backend-id="to-do-api-azure-function" />
          + 
          +      <!-- Append base-path, if defined, before invoking the backend -->
          +     <choose>
          +       <when condition='@(System.String.IsNullOrEmpty("api"))'>
          +       </when>
          +       <otherwise>
          +         <rewrite-uri template='@(System.String.Concat("api/", context.Request.Url.Path))' />
          +       </otherwise>
          +     </choose>
          + 
          +     <set-header name="x-functions-key" exists-action="override">
          +       <value>{{to-do-api-function-key}}</value>
          +     </set-header>
          + 
          +     <cors>
          +       <allowed-origins>
          +           <origin>*</origin>
          +       </allowed-origins>
          +       <allowed-methods>
          +           <method>*</method>
          +       </allowed-methods>
          +       <allowed-headers>
          +           <header>*</header>
          +       </allowed-headers>
          +       <expose-headers>
          +           <header>*</header>
          +       </expose-headers>
          +     </cors>
          +   </inbound>
          +   <outbound>
          +     <base />
          +   </outbound>
          +   <backend>
          +     <base />
          +   </backend>
          +   <on-error>
          +     <base />
          +   </on-error>
            </policies>
        EOT
        # (4 unchanged attributes hidden)
    }

  # module.app_service_roles.module.key_vault.azurerm_role_assignment.secrets["dx-d-itn-common-rg-01|dx-d-itn-common-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5ac0573d-9ffd-4b6e-8767-22db8e2be143"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/dx-d-itn-common-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with azurerm_cosmosdb_sql_container.tasks,
  on cosmos.tf line 37, in resource "azurerm_cosmosdb_sql_container" "tasks":
  37:   partition_key_path    = "/id"

`partition_key_path` will be removed in favour of the property
`partition_key_paths` in version 4.0 of the AzureRM Provider.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
